const openingTexts = [
   "俺はサッカー変態の、「マウロ・イカルドゥ」",
   "幼馴染で彼女の「ワンダ・ミラ」とウェンブリーの森に迷い込んだ時、",
   "黒ずくめの男の怪しげな取引現場を目撃した。",
   "取引を見るのに夢中になっていた俺たちは、背後から近づいてきたもう一人の仲間に気づかなかった。",
   "その男にワンダ・ミラは毒薬を飲まされ、目が覚めたら・・・",
   "記憶が無くなってしまっていたんだ。",
   "俺はなぜか無事だった。",
   "だけど先輩と付き合っていた彼女を、やっとの思いで手に入れたのに、",
   "また1からのスタートになってしまった。",
   "どうやらサッカーIQが高い人がタイプらしいから、自分のサッカーIQが高いということをを見せつけるしかないようだ。",
   "ウェンブリーの森から脱出するためには、黒ずくめの男の手下をサッカーIQを駆使して倒していくしかないから、ついでにIQの高さを証明できる。",
   "俺と彼女は脱出を開始した・・・"
]


export default openingTexts