// ---------------------------------------------------
// --------------エンディングのテキスト---------------
// ---------------------------------------------------
const badEndingText = [
   "ここまで来れたけど、あなたのサッカーIQはたいしたことないのね。",
   "正直がっかりしたわ。",
   "ここでお別れよ。さようなら。"
]

const normalEndingText = [
   "あなたのサッカーIQはなかなかのものだったわ。",
   "改善の余地はあるけれど、いい判断をしてたと思うわ。",
   "私の彼氏のサポートをするために一緒にパリに行きましょう！"
]

const goodEndingText = [
   "あなたのサッカーIQはとても素晴らしかったわ！",
   "要所要所でベストな判断をしていたと思うわ！",
   "今の彼氏とは別れるから、私と付き合いましょう！代理人にもなってあげるわ！",
]



// ---------------------------------------------------
// ----------------選択の後のテキスト-----------------
// ---------------------------------------------------
const goodText = [
   "すごい！倒したわ！",
   "とても良い判断だったわね。"
]
const badText = [
   "なんとか倒せたわね...",
   "だけど今のはあまり良い判断ではなかったかもしれないわね。"
]
const goNextText = "さあ、次に進みましょう"



// ---------------------------------------------------
// ----------------選択の時のテキスト-----------------
// ---------------------------------------------------
const HowToDoText = "どう対処する？"




// ---------------------------------------------------
// ------------敵に遭遇したときのテキスト-------------
// ---------------------------------------------------
const phase1Text = [
   "2トップハイプレスが現れたわ！",
   "あいつはビルドアップの時に、CB二人に対してFW二人でプレスをかけてくるから危険よ。",
   "プレスを上手く突破しないと倒せないわ！"
]
const phase1Decision = [
   {
      text: "ドリブルでかわして縦パスを通そう",
      good: false
   },
   {
      text: "MFをDFラインに降ろして3バックを作ろう",
      good: true
   }
] 


const phase2Text = [
   "5-3-2があらわれたわ！",
   "あいつは最終ラインに5人いるから守備が堅いわよ。",
   "上手く崩さないと倒せないわ！"
]
const phase2Decision = [
   {
      text: "横パスで中盤3人のスライドを遅らせよう",
      good: true
   },
   {
      text: "縦パスを狙って、縦に速い攻撃をしよう",
      good: false
   }
]



// ---------------------------------------------------
// -----------------テキストの集まり------------------
// ---------------------------------------------------
const mainPhrases = [
   phase1Text,
   phase2Text,
   // LastPhaseText
]

const decisions = [
   phase1Decision,
   phase2Decision
]

export {decisions, mainPhrases, goodText, badText, goNextText, HowToDoText, badEndingText, goodEndingText, normalEndingText}